In [1]:
import pandas as pd
import numpy as np

In [2]:
loc = pd.read_table("my_loc.txt", sep="\t", header=None)

In [3]:
loc = loc.replace(np.nan, ' ', regex=True)

In [4]:
loc

,0,1,2,3,4,5,6,7,8,9,...,139,140,141,142,143,144,145,146,147,148
0,NW_022145595.1,3240002,.,A,G,29,PASS,AF=0.357184;DP=1071;NS=138,GT,0/1,...,1/1,0/0,0/1,0/1,0/1,0/0,0/0,0/1,0/1,0/0
1,NW_022145595.1,3240002,.,A,G,29,PASS,AF=0.357184;DP=1071;NS=138,GT,0/1,...,1/1,0/0,0/1,0/1,0/1,0/0,0/0,0/1,0/1,0/0

In [5]:
def row_from_row(pops):
    refs=[]
    alts=[]
    for p in pops:
        t = p.to_numpy()
        te = [ i.split("/") for i in t]
        te = np.delete(te, np.where(te == " "))
        if len(te) < 40:
            te=np.concatenate(te, axis=0 )
            te = np.delete(te, np.where(te == " "))
        temp=[int(i) for i in te]
        ref=len(temp)-sum(temp)
        alt=sum(temp)
        refs.append(ref)
        alts.append(alt)
    return(alts,refs)

In [6]:
for i in range(len(loc)):
    pop1=loc.iloc[i,9:29]
    pop2=loc.iloc[i,29:49]
    pop3=loc.iloc[i,49:69]
    pop4=loc.iloc[i,69:89]
    pop5=loc.iloc[i,89:109]
    pop6=loc.iloc[i,109:129]
    pop7=loc.iloc[i,129:149]
    pops=[pop1,pop2,pop3,pop4,pop5,pop6,pop7]
    alts,refs=row_from_row(pops)
    if i == 0:
        df = pd.DataFrame([alts])
        df = df.append([refs],ignore_index = True) 
    else:
        df = df.append([alts],ignore_index = True)
        df = df.append([refs],ignore_index = True)

/Users/hacking/miniconda3/envs/petak/lib/python3.8/site-packages/numpy/core/_asarray.py:83: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  return array(a, dtype, copy=False, order=order)

In [7]:
df

    0   1   2   3   4   5   6
0  15   9  20  15  22   3  15
1  25  29  20  25  18  35  25
2  15   9  20  15  22   3  15
3  25  29  20  25  18  35  25